[
    {
        "slug": "experian-creditmatcher",
        "title": "Experian CreditMatcher",
        "text": [
        
        ],
        "url" : "creditmatcher.experian.co.uk",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript (ES6)",
            "NodeJS",
            "Handlebars",
            "React",
            "Vue",
            "Amazon Web Services",
            "Mocha/Chai/Jest"
        ]
    },
    {
        "slug": "experian-credit-expert",
        "title": "Experian Credit Expert",
        "text": [
            
        ],
        "url" : "www.creditexpert.co.uk",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            "Angular",
            "Swig"
        ]
    },
    {
        "slug": "lastfm",
        "title": "Last.fm",
        "client": "Personal project",
        "text": [
            "Making use of the <a href=\"http://www.last.fm/\" rel=\"noopener noreferrer\" target=\"_blank\">Last.fm</a> API, this tool simply provides a real-time display of a users\" most recently played tracks, or their top artists of all time, based on track plays. This data is then displayed as thumbnails, which click through to the relevant track/artist page on the Last.fm website."
        ],
        "url" : "lastfm.heyhudson.com",
        "github": "lastfm",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            "Last.fm API"
        ]
    },
    {
        "slug": "gov-petitions",
        "title": "UK Government Petitions",
        "client": "Personal project",
        "text": [
            "An experiment using the publicly-accessible government petitions API. Petitions are searchable by ID, data is returned to the browser and displayed using the KnockoutJS framework. The API is polled periodically to give a real-time update of the number of signatories."
        ],
        "url" : "govpetitions.heyhudson.com",
        "github": "gov-petitions",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            "KnockoutJS",
            "Government API"
        ]
    },
    {
        "slug": "nhs-choices",
        "title": "NHS Choices",
        "client": "Capita",
        "text": [
            "Working on one of the largest websites in Europe, it was my responsibility to create front-end code to the highest standards and then liaise with the back-end developers to ensure it was integrated properly into the solution.</p><p>As a public health information site, accessibility was at the forefront of everything we did, and as such my knowledge of progressive enhancement & graceful degradation, assistive technologies and cross-browser compatibility was increased hugely, helped in no small part by regular contact with third parties, such as the <a href=\"http://www.rnib.org.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">R.N.I.B</a> and <a href=\"https://www.abilitynet.org.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">AbilityNet</a>."
        ],
        "url" : "www.nhs.uk",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            "Sharepoint",
            ".NET"
        ]
    },
    {
        "slug": "nhs-choices-pims",
        "title": "NHS Choices Provider Information Management System",
        "client": "Capita",
        "text": [
            "NHS Choices provided healthcare organisations (such as dentists, GPs and clinics) with an internal <abbr title=\"Content Management System\">CMS</abbr> through which they could update their profile on the NHS website.",
            "The profiles were built up of customisable modules, allowing organisations to add videos, news articles, registration information, opening times and numerous other details about their service.",
            "Making heavy use of JavaScript and jQuery, it was a constantly evolving system which required regular updates and refinement in response to the needs of the organisations."
        ],
        "url" : "www.nhs.uk/Services/gp/Overview/DefaultView.aspx?id=39571",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            ".NET",
            "Sharepoint"
        ]
    },
    {
        "slug": "nhs-choices-media-library",
        "title": "NHS Choices Media Library",
        "client": "Capita",
        "text": [
            "One of the largest pieces of work I was involved in whilst working for NHS Choices was the rebuild of the site&apos;s media library.",
            "As well as being solely responsible for the front-end development, I also had to very quickly familiarise myself with the technical aspects of the <a href=\"https://www.brightcove.com\" rel=\"noopener noreferrer\" target=\"_blank\">new media provider</a> we were switching to. This involved me learning their proprietary markup language, <abbr title=\"Brightcove Experience Markup Language\">BEML</abbr>, and also working with the back-end developers to make best use of their API."
        ],
        "url" : "www.nhs.uk/video",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript/jQuery",
            "BEML",
            ".NET",
            "Sharepoint"
        ]
    },
    {
        "slug": "dept-health-summer-campaign",
        "title": "Department of Health Summer campaign",
        "client": "Capita",
        "text": [
            "Whilst working at NHS Choices, I was often part of the development team on campaign microsites for the Department of Health.",
            "This was a simple one-page site to encourage users to sign up for healthy living emails. Campaign sites were built using the same basic front-end framework, however during the development of this site, I made several accessibility improvements and streamlined some of the markup which not only provided benefits for this site, but also for future sites using the framework."
        ],
        "url" : "www.nhs.uk/summer",
        "madewith": [
            "HTML",
            "CSS",
            ".NET",
            "Sharepoint"
        ]
    },
    {
        "slug": "marshalls-tree-surgeons",
        "title": "Marshalls Tree Surgeons",
        "client": "Bedrock Digital",
        "text": [
            "During a short time working with Bedrock Digital, I worked on several small brochure sites for <abbr title=\"Small and medium enterprises\">SMEs</abbr>, including Marshalls Tree Surgeons.",
            "Working closely with the client throughout, I was responsible for the requirement gathering, prototyping, designing, building and testing of the site, as well as integrating an existing dynamic news feature and basic <abbr title=\"Content Management System\">CMS</abbr>."
        ],
        "url" : "www.marshallstreesurgeons.co.uk",
        "madewith": [
            "HTML",
            "CSS",
            "PHP",
            "MySQL",
            "Photoshop"
        ]
    },
    {
        "slug": "nucleus-change",
        "title": "Nucleus Human Change Technologies",
        "client": "Personal project",
        "text": [
            "Nucleus Human Change Technologies approached me to help them design and build the website arm of a new branding campaign they were launching.",
            "The aim was to create a simple brochure site which would give an overview of the services they offer, as well as offering scope for expansion in the future.</p><p>They were keen to make the site as clean and fresh looking as possible, incorporating imagery and branding which was being used on their printed literature. The site also included multi-media elements in the form of an audio clip from one of their relaxation CD&#8217;s and a video excerpt from one of their presentations."
        ],
        "url" : "www.heyhudson.com/nucleuschange",
        "madewith": [
            "HTML",
            "CSS",
            "JavaScript",
            "PHP",
            "Photoshop",
            "Illustrator"
        ]
    }
]
